{
  "lives": 15,
  "shufflequestions": 1,
  "shuffleanswers": 1,
  "quiz": [
    {
      "Q": "What is <i>not</i> a role of the operating system?",
      "A": [
        "Referee: manage access to resources",
        "Illusionist: hide hardware diversity and resource division",
        "Glue: serve as connection point for various hardware and software components",
        "_Doctor: fix broken programs"
      ]
    },
    {
      "Q": "Using <tt>ls</tt> as an example, how can one check in the shell how a command works?",
      "A": [
        "human ls",
        "_man ls",
        "layman ls",
        "woman ls",
        "heman ls",
        "manual ls"
      ]
    },
    {
      "Q": "Which of the following is least likely to be considered part of the operating system?",
      "A": [
        "Kernel",
        "File System",
        "Graphical User Interface (GUI)",
        "Text-Based User Interface (TUI)",
        "_Hardware"
      ]
    },
    {
      "Q": "What is a Linux distribution?",
      "A": [
        "_Operating System",
        "Virtual Machine",
        "Command Terminal",
        "Probability Distribution",
        "Open Source License"
      ]
    },
    {
      "Q": "What is Unix?",
      "A": [
        "Linux distribution",
        "_Family of Operating Systems",
        "Command Terminal",
        "Special Workstation"
      ]
    },
    {
      "Q": "How can one move up to the parent directory in the Unix shell?",
      "A": ["cwd", "_cd ..", "cd++", "goto parent"]
    },
    {
      "Q": "What is the relationship between BSD, Android, Apple's MacOS and Ubuntu?",
      "A": [
        "They are all completely open-source",
        "There is no relationship",
        "_They are all Unix/Unix-like operating systems within a somewhat shared ecosystem"
      ]
    },
    {
      "Q": "What is a system call?",
      "A": [
        "The type of call the system makes to get the user's attention",
        "_Function provided by operating system that does something on behalf of a program",
        "Modern systems can be called on the phone to execute commands"
      ]
    },
    {
      "Q": "How does one delete a file '<tt>1.txt</tt>' in the Unix shell?",
      "A": ["del 1.txt", "delete 1.txt", "remove 1.txt", "_rm 1.txt"]
    },
    {
      "Q": "Where can one find the trash bin for deleted files in the Unix shell?",
      "A": [
        "/trash",
        "_there is no trash bin, files are deleted immediately",
        "/usr/bin"
      ]
    },
    {
      "Q": "What is least likely to be learned from knowing more about the inner workings of operating systems?",
      "A": [
        "How to design a large, complicated piece of software",
        "_How to reduce the resource needs of software by orders of magnitude",
        "How to hide complexity",
        "How to reduce the latency of a system",
        "How to safely share resources"
      ]
    },
    {
      "Q": "What is Moore's Law?",
      "A": [
        "_Number of transitors in an integrated circuit tends to double every year",
        "Number of computers tends to double every year due to internet of things",
        "Cost of today's computer hardware was roughly twice as high a year ago",
        "CPU clock speed tends to double every year"
      ]
    },
    {
      "Q": "What might happen if all computers running Linux suddenly stopped working?",
      "A": [
        "Barely anything like in the Y2K panic as I do not know anyone using Linux",
        "_World-wide chaos and panic may ensue as servers and infrastructure use Linux a lot"
      ]
    },
    {
      "Q": "What's MS-DOS?",
      "A": [
        "Kernel",
        "Master System DDOS attack",
        "_Obsolete operating system that used a text terminal"
      ]
    },
    {
      "Q": "What is concurrency in relation to parallelism?",
      "A": [
        "Opposite of parallelism: requires finishing one task to start next",
        "_Opportunity for parallelism: finishing one task is not required to start next",
        "Same as parallelism: tasks are executed concurrently on independent hardware"
      ]
    }
  ]
}
